Object.defineProperty(exports, "__esModule", {
  value: true
});
exports.ActionType = undefined;
(function (e) {
  e[e["无"] = 0] = "无";
  e[e["中转"] = 1] = "中转";
  e[e["直接开始一个action"] = 2] = "直接开始一个action";
  e[e["复活时触发的action"] = 3] = "复活时触发的action";
  e[e["触发多个action"] = 4] = "触发多个action";
  e[e["设置节点显示隐藏"] = 5] = "设置节点显示隐藏";
  e[e["设置多个节点显示隐藏并移动"] = 6] = "设置多个节点显示隐藏并移动";
  e[e["节点缓动"] = 7] = "节点缓动";
  e[e["同时缓动多个节点角度"] = 8] = "同时缓动多个节点角度";
  e[e["同时缓动多个节点"] = 9] = "同时缓动多个节点";
  e[e["缩放节点"] = 10] = "缩放节点";
  e[e["播放动画"] = 11] = "播放动画";
  e[e["停止动画"] = 12] = "停止动画";
  e[e["同时缓动多个节点的透明度"] = 13] = "同时缓动多个节点的透明度";
  e[e["播放音效"] = 14] = "播放音效";
  e[e["停止音效"] = 15] = "停止音效";
  e[e["完成一个步骤"] = 16] = "完成一个步骤";
  e[e["游戏胜利"] = 17] = "游戏胜利";
  e[e["触发带值的action"] = 18] = "触发带值的action";
  e[e["设置Key和Value"] = 19] = "设置Key和Value";
  e[e["增加Key的Value"] = 20] = "增加Key的Value";
  e[e["重置擦除节点"] = 21] = "重置擦除节点";
  e[e["游戏失败"] = 22] = "游戏失败";
  e[e["设置Label的内容"] = 23] = "设置Label的内容";
  e[e["随机触发action"] = 24] = "随机触发action";
  e[e["Label数值变化动画"] = 25] = "Label数值变化动画";
  e[e["设置背景速度"] = 26] = "设置背景速度";
  e[e["增加进度条"] = 27] = "增加进度条";
  e[e["播放或停止音乐"] = 28] = "播放或停止音乐";
  e[e["设置层级"] = 29] = "设置层级";
  e[e["创建节点"] = 30] = "创建节点";
  e[e["判断条件触发action"] = 31] = "判断条件触发action";
  e[e["循环action"] = 32] = "循环action";
})(exports.ActionType || (exports.ActionType = {}));