Object.defineProperty(exports, "__esModule", {
  value: true
});
exports.GuessSongCfg = undefined;
exports.GuessSongCfg = [{
  lyric: ["再给我两分葱", "让我把鸡翼煎成饼", "别融化了盐嘞", "你装豆花了", "腰果怎么煎的"],
  time: [0, 4, 8, 11, 13, 16],
  answer: "最长的电影",
  keyboard: ["最", "搁", "长", "难", "念", "匆", "炫", "民", "浅", "的", "经", "那", "匆", "电", "族", "风", "影", "年"],
  songUrl: "guessSong/最长的电影"
}, {
  lyric: ["酱香豆腐皮", "喔哦喔", "无论菜酒还是老鸡", "无论再远还是广西", "凡是挨饿就逗姥爷宰鸡"],
  time: [0, 4, 6, 9, 13, 19],
  answer: "浪漫血液",
  keyboard: ["浪", "年", "手", "机", "血", "如", "十", "漫", "液", "悬", "溺", "香", "广", "西", "满", "屋", "稻", "愿"],
  songUrl: "guessSong/浪漫血液"
}, {
  lyric: ["千层酥圆", "来食炉", "一捻桃花饮果渡", "那一年鸡切食光再重复"],
  time: [0, 2, 4, 7, 14],
  answer: "桃花诺",
  keyboard: ["诺", "孤", "勇", "者", "朵", "朵", "言", "桃", "花", "千", "天", "空", "江", "南", "海", "阔", "骨", "开"],
  songUrl: "guessSong/桃花诺"
}, {
  lyric: ["听见你嗦找羊吃肉咯", "青鱼难啫捣卤食胶补多", "我一吸管你突然间的饥饿", "挥挥洒洒将孜然看通透"],
  time: [0, 6, 12, 18, 24],
  answer: "突然间的自我",
  keyboard: ["突", "好", "的", "夜", "我", "六", "倒", "然", "想", "自", "雨", "月", "带", "间", "你", "第", "七", "章"],
  songUrl: "guessSong/突然间的自我"
}, {
  lyric: ["尝满的甜鸭是我的爱", "面面的青鳝嚼虾滑蒸开", "甚馍羊的街凑醉鸭嘴咬掰", "甚馍羊的搁生菜食嘴开怀"],
  time: [0, 4, 8, 12, 16],
  answer: "最炫民族风",
  keyboard: ["最", "搁", "长", "难", "念", "匆", "炫", "民", "浅", "的", "经", "那", "匆", "电", "族", "风", "影", "年"],
  songUrl: "guessSong/最炫民族风"
}];