Object.defineProperty(exports, "__esModule", {
  value: true
});
exports.starCfg = undefined;
exports.starCfg = [{
  id: 5001,
  name: "火星",
  income: "100000000000000000",
  cost: "100000000000000000000"
}, {
  id: 5002,
  name: "土星",
  income: "1000000000000000000",
  cost: "1000000000000000000000"
}, {
  id: 5003,
  name: "海王星",
  income: "5000000000000000000",
  cost: "5000000000000000000000"
}, {
  id: 5004,
  name: "水星",
  income: "10000000000000000000",
  cost: "10000000000000000000000"
}, {
  id: 5005,
  name: "木星",
  income: "30000000000000000000",
  cost: "30000000000000000000000"
}, {
  id: 5006,
  name: "金星",
  income: "50000000000000000000",
  cost: "50000000000000000000000"
}, {
  id: 5007,
  name: "M78星云",
  income: "100000000000000000000",
  cost: "100000000000000000000000"
}, {
  id: 5008,
  name: "贝吉塔行星",
  income: "1000000000000000000000",
  cost: "999900000000000000000000"
}];